---
kind: property
id: P:Autodesk.Revit.DB.NumberingSchemaTypes.StructuralNumberingSchemas.RebarCoupler
source: html/1488da84-f9c7-c4fe-6241-6a6e20d27164.htm
---
# Autodesk.Revit.DB.NumberingSchemaTypes.StructuralNumberingSchemas.RebarCoupler Property

Built-in schema used for numbering rebar coupler elements

## Syntax (C#)
```csharp
public static NumberingSchemaType RebarCoupler { get; }
```